CSI API ETABS v1
cPropRebar Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropRebar
Public Interface cPropRebar
Dim instance As cPropRebar
public interface class cPropRebar
type cPropRebar =  interface end
The cPropRebar type exposes the following members.
Methods
Name | Description
GetNameList
 Retrieves the names of all defined rebar properties
GetNameListWithData
 Retrieves the names and data of all defined rebar properties
GetRebarProps
 Retrieves dimension data for a rebar property
GetRebarPropsWithGUID
 Retrieves dimension data and GUID for a rebar property
Top
See Also
Reference
ETABSv1 Namespace